Repository: 0-The-Fool-0/tpmp-gr11a-lab9-GPT-Dreamteam
Catalog: BankApp/BankApp/Resources/Localizable.xcstrings
Source language: en
Languages: pl, ru

# account.balance.capitalization
source: including capitalization
pl: z uwzględnieniem kapitalizacji
ru: с учётом капитализации

# account.balance.debt
source: outstanding debt
pl: zadłużenie
ru: задолженность

# account.balance.remainder
source: balance
pl: saldo
ru: остаток

# account.card.payroll.footer
source: Overdraft limit 50 000 ₽ · payroll Mir card.
pl: Limit debetu 50 000 ₽ · karta płacowa Mir.
ru: Лимит овердрафта 50 000 ₽ · зарплатная карта Mir.

# account.card.payroll.subtitle
source: payroll Mir card
pl: karta płacowa Mir
ru: зарплатная карта Mir

# account.card.payroll.title
source: Card account
pl: Rachunek karty
ru: Карт-счёт

# account.card.savings.subtitle
source: savings card
pl: karta oszczędnościowa
ru: сберегательная карта

# account.card.savings.title
source: Card account
pl: Rachunek karty
ru: Карт-счёт

# account.credit.footer
source: Limit 600 000 ₽ · contract rate is shown in the product profile.
pl: Limit 600 000 ₽ · oprocentowanie w profilu produktu.
ru: Лимит 600 000 ₽ · ставка по договору фиксируется в профиле продукта.

# account.credit.subtitle
source: credit line
pl: linia kredytowa
ru: лимитная линия

# account.credit.title
source: Credit account
pl: Rachunek kredytowy
ru: Кредитный счёт

# account.current.subtitle
source: day-to-day operations
pl: operacje bieżące
ru: повседневные операции

# account.current.title
source: Current account
pl: Rachunek bieżący
ru: Текущий счёт

# account.savings.subtitle
source: «Savings»
pl: «Oszczędności»
ru: «Накопления»

# account.savings.title
source: Savings account
pl: Rachunek oszczędnościowy
ru: Сберегательный счёт

# account.tag.active
source: ACTIVE
pl: AKTYWNY
ru: АКТИВЕН

# account.tag.blocked
source: BLOCKED
pl: ZABLOKOWANY
ru: ЗАБЛОКИРОВАН

# account.tag.card
source: CARD
pl: KARTA
ru: КАРТ-СЧЁТ

# account.tag.closed
source: CLOSED
pl: ZAMKNIĘTY
ru: ЗАКРЫТ

# account.tag.credit
source: CREDIT
pl: KREDYTOWY
ru: КРЕДИТНЫЙ

# account.tag.current
source: CURRENT
pl: BIEŻĄCY
ru: ТЕКУЩИЙ

# account.tag.savings
source: SAVINGS
pl: OSZCZĘDNOŚCIOWY
ru: СБЕРЕГАТЕЛЬНЫЙ

# accounts.hint.filter
source: Closed accounts are hidden · active and blocked are shown.
pl: Zamknięte nie są wyświetlane · aktywne i zablokowane — tak.
ru: Закрытые не показываем · активные и заблокированные — да.

# accounts.hint.types
source: Types: current, savings, credit, card account (card subtypes). Payroll card accounts show overdraft limit.
pl: Typy: bieżący, oszczędnościowy, kredytowy, rachunek karty (podtypy). Dla karty płacowej pokazany limit debetu.
ru: Типы: текущий, сберегательный, кредитный, карт-счёт (подтипы карты). Для зарплатного карт-счёта показан лимит овердрафта.

# accounts.title
source: Accounts
pl: Rachunki
ru: Счета

# branch.brest.main
source: Brest, Sovetskaya St.
pl: Brześć, ul. Sowiecka
ru: Брест, ул. Советская

# branch.minsk.center
source: Minsk, Independence Ave.
pl: Mińsk, al. Niepodległości
ru: Минск, пр. Независимости

# branch.minsk.east
source: Minsk, Partizansky Ave.
pl: Mińsk, al. Partyzancki
ru: Минск, пр. Партизанский

# branch.minsk.south
source: Minsk, Prytytskogo St.
pl: Mińsk, ul. Prytyckiego
ru: Минск, ул. Притыцкого

# branches.description
source: Map with branches and a button to find the nearest office using your location.
pl: Mapa oddziałów i przycisk wyszukania najbliższego na podstawie lokalizacji.
ru: Карта с отделениями и кнопка «Ближайшее» для запроса геолокации.

# branches.location.denied
source: Location access denied. Enable it in Settings.
pl: Brak dostępu do lokalizacji. Włącz w Ustawieniach.
ru: Нет доступа к геолокации. Включите в Настройках.

# branches.nearest.button
source: Nearest
pl: Najbliższy
ru: Ближайшее

# branches.nearest.result
source: Nearest branch
pl: Najbliższy oddział
ru: Ближайшее отделение

# branches.title
source: Branches
pl: Oddziały
ru: Отделения

# home.branches.title
source: Branches nearby
pl: Oddziały w pobliżu
ru: Отделения рядом

# home.greeting.afternoon
source: GOOD AFTERNOON
pl: DZIEŃ DOBRY
ru: ДОБРЫЙ ДЕНЬ

# home.greeting.evening
source: GOOD EVENING
pl: DOBRY WIECZÓR
ru: ДОБРЫЙ ВЕЧЕР

# home.greeting.morning
source: GOOD MORNING
pl: DZIEŃ DOBRY
ru: ДОБРОЕ УТРО

# home.greeting.night
source: GOOD NIGHT
pl: DOBREJ NOCY
ru: ДОБРОЙ НОЧИ

# home.rates.footer
source: buy · CB + spread
pl: kupno · NBP + spread
ru: покупка · ЦБ + спред

# home.rates.title
source: Exchange rates (cash desk)
pl: Kursy walut (kasa)
ru: Курсы валют (касса)

# home.service.accounts.subtitle
source: Current, savings, credit, card accounts
pl: Bieżące, oszczędnościowe, kredytowe, karty
ru: Текущие, сберегательные, кредитные, карт-счета

# home.service.accounts.title
source: View accounts
pl: Przeglądaj rachunki
ru: Просмотреть счета

# home.services.title
source: Services
pl: Usługi
ru: Сервисы

# home.summary.available
source: Available today
pl: Dostępne dziś
ru: Доступно на сегодня

# home.summary.note
source: Excluding blocked accounts. Card with overdraft — in the account list.
pl: Bez zablokowanych rachunków. Karta z debetem — na liście.
ru: Без учёта заблокированных счетов. Карта с овердрафтом — в списке счетов.

# home.summary.title
source: Account summary
pl: Podsumowanie rachunków
ru: Сводка по счетам

# home.summary.updated %@
source: updated %@
pl: zaktualizowano %@
ru: обновлено %@

# login.button.signIn
source: Sign in
pl: Zaloguj się
ru: Войти

# login.error.empty
source: Enter login and password.
pl: Wpisz login i hasło.
ru: Введите логин и пароль.

# login.error.invalid
source: Invalid login or password.
pl: Nieprawidłowy login lub hasło.
ru: Неверный логин или пароль.

# login.eyebrow
source: CLIENT PORTAL
pl: PANEL KLIENTA
ru: КЛИЕНТСКИЙ КАБИНЕТ

# login.faceID
source: Sign in with Face ID…
pl: Zaloguj przez Face ID…
ru: Войти по Face ID…

# login.faceID.message
source: Face ID is not available in this demo build.
pl: Face ID nie jest dostępne w tej wersji demonstracyjnej.
ru: Face ID недоступен в этом демо-макете.

# login.field.password
source: Password
pl: Hasło
ru: Пароль

# login.placeholder.login
source: e.g. elena.kuznetsova
pl: np. elena.kuznetsova
ru: например, elena.kuznetsova

# login.placeholder.password
source: Password
pl: Hasło
ru: Пароль

# login.subtitle
source: Enter login and password.
pl: Wpisz login i hasło.
ru: Введите логин и пароль.

# login.title
source: Sign in
pl: Logowanie
ru: Вход

# tab.home
source: Home
pl: Główna
ru: Главная

# tab.more
source: More
pl: Więcej
ru: Ещё

# tab.payments
source: Payments
pl: Płatności
ru: Платежи

# tab.placeholder
source: Section coming soon in this lab build.
pl: Sekcja będzie dostępna w kolejnej wersji.
ru: Раздел будет доступен в следующей версии.

# tab.support
source: Support
pl: Pomoc
ru: Поддержка

# login.field.login
source: Login
ru: Логин
